app/Controllers/Home.php

    public function index(): string
    {

        $user = $this->UserModel->find($this->session->get('user_id'));
        $BalanceModel = $this->BalanceModel->get_balance($this->session->get('user_id'));
        $ServicesModel = $this->ServicesModel->findAll();
        $BannersModel = $this->BannersModel->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'
SELECT *
FROM `services`
SELECT *
FROM `banners`

    public function topup()
    {
        $user = $this->UserModel->find($this->session->get('user_id'));
        $BalanceModel = $this->BalanceModel->get_balance($this->session->get('user_id'));
        $ServicesModel = $this->ServicesModel->findAll();
        $BannersModel = $this->BannersModel->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'
SELECT *
FROM `services`
SELECT *
FROM `banners`

    public function profile_view(){
        $user = $this->UserModel->find($this->session->get('user_id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'

    public function transaction_history()
    {
        $user = $this->UserModel->find($this->session->get('user_id'));
        $BalanceModel = $this->BalanceModel->get_balance($this->session->get('user_id'));
        $limit = 5;
        $offset = 0;
        $th_count = 0;
        $get_th_count = 0;
        $transaksi_history_count = $this->TransactionsModel->get_data_by($this->session->get('user_id'), 'users_id');
        if($transaksi_history_count){
            $th_count = count($transaksi_history_count);
        }

        $transaksi_history = $this->TransactionsModel->get_data($this->session->get('user_id'), 'users_id', $limit, $offset);
        $history = array();
        if ($transaksi_history) {
            $get_th_count = count($transaksi_history);
            foreach ($transaksi_history as $thv) {
                if ($thv['services_id'] == 0) {
                    $history[] = [
                        'description' => 'Top Up Saldo',
                        'type_class' => 'text-success',
                        'transaction_type' => $thv['transaction_type'],
                        'total_amount' => "+ Rp " . format_rupiah($thv['total_amount']),
                        'created_on' => date("d F Y h:i:s", strtotime($thv['created_on'])) . " WIB"
                    ];
                } else {
                    $ServicesModel = $this->ServicesModel->find($thv['services_id']);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'
SELECT *
FROM `services`
WHERE `services`.`id` = '24'

                'users_id' => $this->session->get('user_id'),
                'balance' => $total_saldo,
            ];
            $this->BalanceModel->update($BalanceModel['id'], $data);
---
UPDATE `balances` SET `users_id` = '2', `balance` = 260000
WHERE `balances`.`id` IN ('1')

            'total_amount' => $service_tariff,
            'created_on' => date("Y-m-d h:i:s"),
        ];
        $this->TransactionsModel->insert($data_transaction);
---
INSERT INTO `transactions` (`users_id`, `invoice_number`, `services_id`, `transaction_type`, `total_amount`, `created_on`) VALUES ('2', 1764325087, '24', 'PAYMENT', '300000', '2025-11-28 10:18:07')

    public function topup_saldo()
    {
        $nominal_saldo = $this->request->getVar('top_up_amount');
        if ($nominal_saldo < 10000 || $nominal_saldo > 1000000) {
            return $this->response->setJSON(["status" => false, 'pesan' => view("layout/partials/modal_gagal_content", ['nominal' => format_rupiah($nominal_saldo), 'title' => "Top Up sebesar", 'btn_text_lanjut' => 'Ya, lanjutkan Bayar', 'btn_text_batal' => 'Kembali ke Beranda', 'btn_class_lanjut' => 'lanjutkan-ts-modal'])]);
        }
        $user = $this->UserModel->find($this->session->get('user_id'));
        $total_saldo = $nominal_saldo;
        $BalanceModel = $this->BalanceModel->get_balance($this->session->get('user_id'));
        if (isset($BalanceModel['balance'])) {
            $saldo_user = $BalanceModel['balance'];
            $total_saldo = $total_saldo + $saldo_user;
            $data = [
                'users_id' => $this->session->get('user_id'),
                'balance' => $total_saldo,
            ];
            $this->BalanceModel->update($BalanceModel['id'], $data);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'
UPDATE `balances` SET `users_id` = '2', `balance` = 60000
WHERE `balances`.`id` IN ('1')

            'total_amount' => $nominal_saldo,
            'created_on' => date("Y-m-d h:i:s"),
        ];
        $this->TransactionsModel->insert($data_transaction);
---
INSERT INTO `transactions` (`users_id`, `invoice_number`, `services_id`, `transaction_type`, `total_amount`, `created_on`) VALUES ('2', 1764325040, 0, 'TOPUP', '50000', '2025-11-28 10:17:20')