app/Controllers/ServiceController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
    public function detail($service_code=''){
        $service_code = strtoupper($service_code);
        $user = $this->UserModel->find(session()->get('user_id'));