app/Models/BalanceModel.php

    public function get_balance($user_id=0){
        $query = $this->table($this->table)->where("users_id",$user_id)->first();
---
SELECT *
FROM `balances`
WHERE `users_id` = '2'
 LIMIT 1