app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'admin@email.com'
 LIMIT 1
---
    public function check_login($email){
        $query = $this->table($this->table)->where("email",$email)->first();